#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/briananderson-xyz/brian-dev-1222/runs/run-pG3TS7Rmrt5c92LY

Waiting for the plan to start...

Terraform v1.7.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repo will be created
  + resource "google_artifact_registry_repository" "artifact-repo" {
      + create_time      = (known after apply)
      + description      = "Image repository for storing images to be deployed"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "brian-dev-1222"
      + repository_id    = "container-registry"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # google_artifact_registry_repository_iam_member.cicd will be created
  + resource "google_artifact_registry_repository_iam_member" "cicd" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = (known after apply)
      + project    = (known after apply)
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # google_artifact_registry_repository_iam_member.cluster will be created
  + resource "google_artifact_registry_repository_iam_member" "cluster" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = (known after apply)
      + project    = (known after apply)
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + deletion_protection         = false
      + enable_autopilot            = true
      + enable_intranode_visibility = true
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "autopilot-cluster-1"
      + network                     = "default"
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + cluster_autoscaling {
          + enabled = (known after apply)

          + auto_provisioning_defaults {
              + oauth_scopes    = [
                  + "https://www.googleapis.com/auth/cloud-platform",
                ]
              + service_account = (known after apply)
            }
        }
    }

  # google_iam_workload_identity_pool.automation will be created
  + resource "google_iam_workload_identity_pool" "automation" {
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "brian-dev-1222"
      + state                     = (known after apply)
      + workload_identity_pool_id = "github"
    }

  # google_iam_workload_identity_pool_provider.github-automation will be created
  + resource "google_iam_workload_identity_pool_provider" "github-automation" {
      + attribute_condition                = "'briananderson1222' in attribute.repository_owner"
      + attribute_mapping                  = {
          + "attribute.actor"            = "assertion.actor"
          + "attribute.repository"       = "assertion.repository"
          + "attribute.repository_owner" = "assertion.repository_owner"
          + "google.subject"             = "assertion.sub"
        }
      + display_name                       = "Demo App Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "brian-dev-1222"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github"
      + workload_identity_pool_provider_id = "github-automation"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # google_project_iam_binding.cluster-roles["roles/autoscaling.metricsWriter"] will be created
  + resource "google_project_iam_binding" "cluster-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "brian-dev-1222"
      + role    = "roles/autoscaling.metricsWriter"
    }

  # google_project_iam_binding.cluster-roles["roles/logging.logWriter"] will be created
  + resource "google_project_iam_binding" "cluster-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "brian-dev-1222"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_binding.cluster-roles["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_binding" "cluster-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "brian-dev-1222"
      + role    = "roles/monitoring.metricWriter"
    }

  # google_project_iam_binding.cluster-roles["roles/monitoring.viewer"] will be created
  + resource "google_project_iam_binding" "cluster-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "brian-dev-1222"
      + role    = "roles/monitoring.viewer"
    }

  # google_project_iam_binding.cluster-roles["roles/stackdriver.resourceMetadata.writer"] will be created
  + resource "google_project_iam_binding" "cluster-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "brian-dev-1222"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # google_project_iam_member.cicd-container-developer will be created
  + resource "google_project_iam_member" "cicd-container-developer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "brian-dev-1222"
      + role    = "roles/container.developer"
    }

  # google_project_service.cloudresource will be created
  + resource "google_project_service" "cloudresource" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "brian-dev-1222"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_service_account.cicd will be created
  + resource "google_service_account" "cicd" {
      + account_id   = "pipeline"
      + disabled     = false
      + display_name = "CI/CD Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "brian-dev-1222"
      + unique_id    = (known after apply)
    }

  # google_service_account.cluster will be created
  + resource "google_service_account" "cluster" {
      + account_id   = "cluster"
      + disabled     = false
      + display_name = "Service Account for operating GKE with minimum permissions"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "brian-dev-1222"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.cicd-workload-identity will be created
  + resource "google_service_account_iam_member" "cicd-workload-identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.json

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.json"

```

</details>

*Pusher: @briananderson1222, Action: `pull_request`, Working Directory: ``, Workflow: `Demo Infrastructure Pipeline`*